boxTurb/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
4096
(
(0.00545555 0.000524922 -0.0135398)
(0.00394471 0.0101048 -0.0135083)
(0.0128751 -0.00611809 -0.00886135)
(0.0126149 -0.0184447 -0.0161924)
(0.0148709 -0.0267829 -0.00855942)
(0.00962619 -0.00588087 -0.0146561)
(-0.00709785 -0.00287333 0.0156187)
(-0.0135053 -0.00268575 0.0212491)
...
)
;

boundaryField
{
    patch0_half0
    {
        type            cyclic;
    }
    patch0_half1
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
    patch2_half0
    {
        type            cyclic;
    }
    patch2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
